In [1]:
# Dependencies and Setup
import pandas as pd

In [2]:
# File to Load (Remember to Change These)
file_to_load = "C:/Users/JPHeb/JPH-Data-Class/pandas-challenge/Heroes_of_Pymoli/Resources/purchase_data.csv"

In [3]:
# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(file_to_load)

In [4]:
purchase_data_df2 = purchase_data_df.loc[:, ["Gender", "Username", "Age"]]
purchase_data_df2

C:\Users\JPHeb\Anaconda3\lib\site-packages\pandas\core\indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

     Gender  Username  Age
0      Male       NaN   20
1      Male       NaN   40
2      Male       NaN   24
3      Male       NaN   24
4      Male       NaN   23
..      ...       ...  ...
775  Female       NaN   21
776    Male       NaN   21
777    Male       NaN   20
778    Male       NaN    7
779    Male       NaN   24

[780 rows x 3 columns]

In [5]:
dropped_username = purchase_data_df2.drop_duplicates()
dropped_username

                    Gender  Username  Age
0                     Male       NaN   20
1                     Male       NaN   40
2                     Male       NaN   24
4                     Male       NaN   23
5                     Male       NaN   22
..                     ...       ...  ...
557                   Male       NaN   42
637  Other / Non-Disclosed       NaN   24
667                 Female       NaN   40
674                   Male       NaN   43
761                   Male       NaN   45

[69 rows x 3 columns]

In [6]:
Gender_count = dropped_username["Gender"].value_counts()
Gender_count

Male                     39
Female                   22
Other / Non-Disclosed     8
Name: Gender, dtype: int64

In [7]:
Gender_count_df = pd.DataFrame(Gender_count)
Gender_count_df

                       Gender
Male                       39
Female                     22
Other / Non-Disclosed       8